#ifndef task_2_1
#define task_2_1


/*

1.	Нефтяное месторождение. Месторождению принадлежат скважины, 
	скважины бывают трех видов - нефтяные, газовые, нагнетательные 
	(для закачки воды в пласт). 
	Месторождение оперерует параметрами: объем газа в месторождении, объем нефти, 
	объем воды. У каждой скважины есть параметр – объем выкаченного или закаченного 
	содержимого. Задача заключается в моделировании работы месторождения. 
	Предполагается интерфейс для задания параметров месторождения, добавления/удаления 
	скважин, задания параметром каждой скважины, а также включения/выключения ее работы.
*/

//system
#include <memory>

//user
#include "field.hpp"
#include "cli.hpp"


#endif